from aiogram.utils.keyboard import InlineKeyboardMarkup, InlineKeyboardBuilder, InlineKeyboardButton
from core.gdz.gdz_finder import get_authors


classes = {
    '1': ['Окружающий мир', 'Математика', 'Русский язык', 'Литература', 'Английский язык'],
    '2': ['Окружающий мир', 'Математика', 'Русский язык', 'Литература', 'Английский язык'],
    '3': ['Окружающий мир', 'Математика', 'Русский язык', 'Литература', 'Английский язык'],
    '4': ['Окружающий мир', 'Математика', 'Русский язык', 'Литература', 'Английский язык'],
    '5': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Математика', 'Русский язык', 'Литература', 'Английский язык'],
    '6': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Математика', 'Русский язык', 'Литература', 'Английский язык'],
    '7': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Алгебра', 'Геометрия', 'Русский язык', 'Литература', 'Английский язык', 'Физика'],
    '8': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Алгебра', 'Геометрия', 'Русский язык', 'Литература', 'Английский язык', 'Физика', 'Химия'],
    '9': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Алгебра', 'Геометрия', 'Русский язык', 'Литература', 'Английский язык', 'Физика', 'Химия'],
    '10': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Алгебра', 'Геометрия', 'Русский язык', 'Литература', 'Английский язык', 'Физика', 'Химия'],
    '11': ['История', 'Биология', 'География', 'Общество', 'Информатика', 'Алгебра', 'Геометрия', 'Русский язык', 'Литература', 'Английский язык', 'Физика', 'Химия'],
}

subjects = {
    'Окружающий мир': 'okruzhajushhij_mir/', 'Математика': 'matematika/', 'Русский язык': 'russkii_yazik/', 'Литература': 'literatura/',
    'Английский язык': 'english/', 'История': 'istoriya/', 'Биология': 'biologiya/', 'География': 'geografiya/', 'Общество': 'obshhestvoznanie/',
    'Информатика': 'informatika/', 'Алгебра': 'algebra/', 'Геометрия': 'geometria/', 'Физика': 'fizika/', 'Химия': 'himiya/'
}

async def create_subjects_kb(cls) -> InlineKeyboardMarkup:
    kb = InlineKeyboardBuilder()
    for i in classes[cls]:
        kb.add(InlineKeyboardButton(text=str(i), callback_data=subjects[str(i)]))
        kb.adjust(3)
    return kb.as_markup()

async def create_authors_kb(cls, subject) -> InlineKeyboardMarkup:
    kb = InlineKeyboardBuilder()
    authors = get_authors(cls=cls, subject=subject)
    for author, link in authors.items():
        kb.add(InlineKeyboardButton(text=str(author), callback_data=link))
        kb.adjust(3)
    return kb.as_markup()